{"0": {"Reviewer": "Mike B (Great Lakes Tequila Club)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 316, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 43|The infamous Lot 43! A friend shared a glass with me and I finally got to try a holy grail tequila. What can I say about this supposedly XA-blended Añejo other than it was delicious aged Fortaleza.", "Recommend": 1}, "1": {"Reviewer": "Jon Novak", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 161, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 55|Incredible. Such a dessert sipper. Beautiful barrel notes on the nose and the palate is a treat. From beginning to finish this is a treat through and through.", "Recommend": 1}, "2": {"Reviewer": "Frankie Medina", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 287, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 63|This lot 63 is one of the better añejo s from Fortaleza since lot 48.", "Recommend": 1}, "3": {"Reviewer": "Jon Novak", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 161, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 59|Wow! This is worth the price.  A total dessert sipper. Creamy with lots of layers.  Very amazing tequila that retains the agave on the nose and palate", "Recommend": 1}, "4": {"Reviewer": "Nick Salcedo @tequilarankings", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 93, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "On the nose, aromas of dried fig, mixed with agave, Ceylon cinnamon, and brown sugar. The flavor further melds the cinnamon and agave, with notes of dried apricot as well. The finish brings out greater depth from all the flavors, while being dangerously easy to drink.", "Recommend": 1}, "5": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 60|Nose:   A touch of cider and spice. Vanilla, fruity agave and toasty hints of oak barreling. Subdued minerals and earth. A rich, round fruity profile. Flavor:   A cohesive/harmonious first impression. Fruit, spice, mild pepper heat and mellow oak wrapped in a buttery package. It blooms as it sits on the palate.", "Recommend": 1}, "6": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 52|Nose:   Light oak sawdust aroma and warm barrel spices. Maple, coffee and vanilla. Citron and lemon blossom. Flavors:   Orange liqueur, caramel, dark chocolate and punchy pepper. Vanilla and fruit flavors develop as it breathes a bit. ", "Recommend": 1}, "7": {"Reviewer": "Andy Bardon", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 172, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 42|Lote: 42-AWhat an amazing mistake!Dried prunes, vanilla, oak, and agave. What a treat. Oily, thick, and syrupy mouthfeel. This is a very special bottle that really opens my mind to the idea of barrel blending. More research is required … twist my arm", "Recommend": 1}, "8": {"Reviewer": "Rob Gerard", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 201, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 52|Lote 52 - this is one of my favorite Añejos! Aroma - oak, cinnamon, agave, slight vanilla and caramel, with a touch of butterscotch. Flavor - oak, toasted almond, vanilla, hints of cinnamon. Finish - toffee buttery finish that has very little burn. More of a warmth in the lower chest. Easy to drink. Just fantastic to sip on!", "Recommend": 1}, "9": {"Reviewer": "Jeremy Kinney", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 153, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 43|Super lucky to have gotten my hands on some lot 43. Amazing nose, tons of caramel, cinnamon and baking spice but still a nice pop of agave. Flavor still carries a lot more agave than I expected. Peppery, and mellowed nicely from the barrel. Very complex and an absolute gem of a tequila.", "Recommend": 1}, "10": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 51|Nose:   Initial blast of warm barrel spices. Followed up with a woodsy forest aroma, hot cider with a stick of cinnamon, vanilla, juicy fruit, oranges and grilling pineapple. Flavors:   Oily and has tons of fruit (perhaps dark cherries), dried fruit and candied fruit. It brings a spicy and peppery tingle to the tongue and esophagus. Very different from other Fortaleza añejos of recent memory. This has a dessert like quality to it. Almost tastes like some French oak was blended in. Or some XA.", "Recommend": 1}, "11": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 47|Love this as I do all releases. This seems to have more actual barrel than some Añejo releases with some slight bitterness from the re charred barrels. Nicely aromatic with agave, oak, caramel along with a nicely rounded feel in the mouth. Some slight spike in alcohol mid palate that turns to roast agave sweetness, a great tongue tingling finish that fades to that slight bitter remnant.", "Recommend": 1}, "12": {"Reviewer": "Lou  Agave (Long Island Lou Tequila)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 399, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 42|This is the special anejo, mixed with extra anejo, and it has a great balance considering. It's got a great nose, picking up all kinds of barrel notes from the extended aging.  Absolutely delicious notes coming through, with butterscotch, smoke, vanilla, caramel, fruit, honey and butter. Delicious!!", "Recommend": 1}, "13": {"Reviewer": "Andrew Davis", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 248, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 48|Nice caramel notes on the nose. Darker color than other lotes. Heavier on the oak which is prominent and a subtle cooked agave flavor.", "Recommend": 1}, "14": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 49|Nose:   Subtly intertwining spices of allspice, nutmeg and cardamom. Citrus, pepper, vanilla and white chocolate. Tropical fruit, slightly under ripe pineapple, and smells similar to green lumber that is drying. Flavor:   Initial pop of finely ground white pepper and baking spice. Sweet citrus, fruit, vanilla, and nutty salted caramel. Trace earthiness, cedar aromas and salinity. A touch of leather. Finish:   Bigger, bolder and more memorable finish than some recent lotes, IMHO.", "Recommend": 1}, "15": {"Reviewer": "Greg Bartolotta @aged_agave", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 47|Hand crafted artesanal Anejo doesn’t get much better than this ... this is the bench mark. Good heat but tremendously balance with an incredible finish. All time favorite.", "Recommend": 1}, "16": {"Reviewer": "Ralph Jimenez", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 199, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 42|Aroma has", "Recommend": 1}, "17": {"Reviewer": "Jose Gomez", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 142, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 42|At nose, aroma is pretty fruity. tropical fruits come to record, such as banana. Light spices too, as cinnamon. Cooked agave aroma floats beneathz as well as some butterish notes. This is not the typical añejo profile in which you get lots of dark spice, wood and vanilla. At taste it is more complex. I get the wood right away the first sip, pepper explodes in my tongue's tip. afterwards, nice cooked away come to record. Bold character in the aftertaste, featuring ripe fruit tastes while coming to an end. This is a well balances añejo that still respects agave flavour,  but marries the aging wood taste pretty well, coming to a well executed balancing act.", "Recommend": 1}, "18": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 48|Poured at MTBC 2019. Sweet agave, caramel, vanilla. Unmistakable Fortaleza creaminess and flavor.", "Recommend": 1}, "19": {"Reviewer": "Andrew Davis", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 248, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|The nose on this is one of my favorites ever with vanilla being prominent.", "Recommend": 1}, "20": {"Reviewer": "Erica Boorom", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 128, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Aroma : Cooked agave, vanilla, caramel. Some oakiness along with butter and olives.Taste : Full bodied, oily and complex with plenty of agave for an Añejo, vanilla and caramel, more oak and butter and olives. I also got some fruity/peach notes and butterscotch.Finish : Long lasting and slightly spicy, and prolongs butter, butterscotch, and oak notes.This is a good balance of sweet and spicy, and it's very complex. I've been away the past 2 weeks, and this was a great tequila to have after so long. I'm stocked on many more tequilas so I definitely hope they measure up to this.", "Recommend": 1}, "21": {"Reviewer": "Joe Farrier", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 155, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 40|Lot 40.  Agave flavor tempered slowly by vanilla, Carmel and butterscotch.  The finish is perfectly timed but does stop a smidge short on flavors as the entire tequila vanishes a bit too quickly.  The best anejo I’ve ever had.", "Recommend": 1}, "22": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 46|Aroma:   This is not a typical Fortaleza añejo profile to me. The initial nose presents round, fruity cider notes, with some almost French oak character. Lively spices of green cardamom in the shell and cinnamon - and a hint of toffee. A vague vinegar aroma - but cloaked in the spice aromas. Flavors:   Spicy barrel influence, vanilla, butterscotch and white pepper. The light color of this añejo conveys a somewhat deceptive impression - it is rich and fills the mouth.", "Recommend": 1}, "23": {"Reviewer": "Senior Rick Mendell", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 283, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 42|Delicious, deeply concentrated roasted agave with an enjoyable rich, smooth finish. And a bit richer mouth feel than the Lote 43.", "Recommend": 1}, "24": {"Reviewer": "Senior Rick Mendell", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 283, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 43|Delicious, deeply concentrated roasted agave with an enjoyable peppery finish.", "Recommend": 1}, "25": {"Reviewer": "Scarlet Sanschagrin", "Reviewer_Level": "Tequila Boss", "Ratings_Given": 539, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 46|Lighter than the normal anejo, but has a richer mouthfeel and a cheesier aroma than we usually get in the anejo. After it opens, surprising honey aroma in the bottom of the glass. (New barrels?). A little different but good!", "Recommend": 1}, "26": {"Reviewer": "Ralph Jimenez", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 199, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 28|Aroma had loads of caramel, baked agave, and some vanilla, along with oak. Flavor has plenty of sweet baked agave, caramel with a hint of wood. The finish has a medium mouth feel with a great long finish.", "Recommend": 1}, "27": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 21|Opened for my birthday. Creamy caramelized agave, barrel notes of oak and vanilla and a wonderful finish. Salud to being 66 years old.", "Recommend": 1}, "28": {"Reviewer": "Andy Bardon", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 172, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Killer. Delicious balance of agave and oak. I was thinking the oak would be stronger due to the length of aging, but they’ve done an amazing job of letting the agave shine through. Well balanced, and reasonably priced IMO. Bravo", "Recommend": 1}, "29": {"Reviewer": "Scarlet Sanschagrin", "Reviewer_Level": "Tequila Boss", "Ratings_Given": 539, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|Orange peel, caramel, a touch of chocolate, yet bright agave flavor and natural sweetness. This rare blend of anejo and XA is a real gem.", "Recommend": 1}, "30": {"Reviewer": "Mike Thomas", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 161, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 42|This review is for lote 42. The complexity of this expression is deep. The more i dig, the more flavors and notes come out. Cooked agave, butterscotch, toffee, chocolate and caramel hit my nose, initially. This is a viscous juice and the notes on the nose carry through on the palate, giving way to vanilla, peach, berries and cinnamon. Thank you, Guillermo, thank you.", "Recommend": 1}, "31": {"Reviewer": "Evan Petrie", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 40, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 43|Lot 43-A. Full of cooked agave, vanilla and caramel. Lots of oak too, but isn’t overpowering.", "Recommend": 1}, "32": {"Reviewer": "Jay MacRaild", "Reviewer_Level": "Tequila Badass", "Ratings_Given": 470, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "Lot 43|Despite the long aging it stays true to the house style, Hubba Bubba in the roof of my mouth with all that earthy goodness you expect from this brand. It’s amazing!!!!", "Recommend": 1}, "33": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 41|Nose:   Herbal and grassy notes with a flinty mineral note, transitioning into big caramelized agave presence.  Fruit, vanilla and a hint of lactic round out the aromas. Flavors:   Pleasant barrel spices, white pepper, vanilla and an undercurrent of flowers. There is a residual almond note and tannins as well. I am rating this after several months of enjoying lote 42, and more recently 43. It is a totally different profile and a refreshing change up.", "Recommend": 1}, "34": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|This lote 43 is being evaluated next to a glass of lote 42.   A couple of tequila aficionados that I really respect have found the lote 43 to be superior.I’m having difficulty discerning huge differences. 43 seems to have a softer nose - maybe more butterscotch and nutmeg and less cardamom...In the mouth, 43 is less hot and a little rounder - less fire. Yet it still has tons of barrel spice heat. The finish on 43 might be a little more buttery. I’m having to nit pick.... I will have to defer to those with more highly refined palates - but I like them both!", "Recommend": 1}, "35": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 08|Tasted at Casa Rick and Candy on 13/09/2018. Caramelized agave along with agave buttercream in the mouth. These older lotes have just a ton of character and flavor.", "Recommend": 1}, "36": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 43|Same, same, same as the other one.", "Recommend": 1}, "37": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 42|Nose:   I could write an essay, there is so much going on. I’ve switched between a Glencairn, a Glencairn nosing glass, and the Stolzle jarrito for my nosing. Initially, vanilla and white chocolate notes, cider, dark ripe berries, floral nuances and hints of ripe cheese. Oak is wending its way through the the multitude of aromas. Flavor:   Explosive spice notes: pepper, cinnamon and cardamom. It totally engulfs your palate. Great mouth feel. Big agave presence, cherry and tropical fruits. Finish:   Long lasting, dynamic finish highlighted with anise, pepper and a honey like mouth sensation. This is such a complex Añejo, that every time I revisit it, I think I will find different nuances. Second night tasting additional notes. Nose:  I’m noticing butterscotch, olives and more oak this time around. Flavor:   Picking up anise and more heat tonight. Finish:   Noticing more sweetness and honey notes. I can’t stay out of this bottle!", "Recommend": 1}, "38": {"Reviewer": "Bubba Atherton", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 128, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 42|Initially I thought this lote was just ok . But upon the “revisit “ almost two weeks later ,  and a longer than usual resting of the glass , holy shit ! This stuff opens up like you wouldn’t believe !!! Glad we kept a few bottles ! Khrys wasn’t jiven!!! My initial score was 89 but should be about 5 or 6 points higher after this tasting .", "Recommend": 1}, "39": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 42|Rating 600. I leave you to draw your own conclusions about this lote. Seek some out.08/04/2018", "Recommend": 1}, "40": {"Reviewer": "Bryce Taylor (Austin Tequila Connoisseurs)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 306, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 41|Fortaleza is one of the gold standards of tequila. The Anejo has a bright citrus smell and the cooked agave punches through nicely. The taste is full of cooked agave, light oak, pepper and then there is a sweet medium finish. This is an excellent sipper!", "Recommend": 1}, "41": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 893, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 25|Intense agave and aged Parmesan cheese nose with a salty quality. Tropical fruits and floral notes. Big spicy entrance on the tongue. Agave forward with vanilla and pineapple following. Some herbal undertones and nice pepper warmth. Complex...Finish is a totally satisfying and long. It is still coating my tongue with bursts of nuances.", "Recommend": 1}, "42": {"Reviewer": "Grover Sanschagrin", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1019, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 26|Wow, this is great stuff. Lot 26!", "Recommend": 1}, "43": {"Reviewer": "Mike B (Great Lakes Tequila Club)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 316, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 36|Lot 36 has a more floral aroma than I remember from other tastings. This is buttery smooth gold.", "Recommend": 1}, "44": {"Reviewer": "Adam Stemmler", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 326, "Tequila": "Fortaleza Añejo", "Rating": 82, "Review": "Lot 36|Artichoke, custard, salt water taffy", "Recommend": 1}, "45": {"Reviewer": "Mike B (Great Lakes Tequila Club)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 316, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "This is crazy good. Aroma, taste, and finish can't be beat. My new favorite. If only I could afford it.", "Recommend": 1}, "46": {"Reviewer": "Craig Macadang", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1253, "Tequila": "Fortaleza Añejo", "Rating": 81, "Review": "Lot 34|Sweet aroma but flavor did match.  Flavor and finish more of the barrel, smokey.", "Recommend": 1}, "47": {"Reviewer": "Peniel Castillo", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 77, "Review": "Lot 34|Aroma= Sweet like toffeeFlavor= sal de gusano,  smoky. this one threw me off, Tequila doesn't taste like it smells.  very interesting", "Recommend": 1}, "48": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 34|Nose - Mild spiceTaste - Strong alcohol and charred barrel notes that have some agave sweetnessFinish - Fades to bourbon sugar and some hints of bitterness from the oak", "Recommend": 1}, "49": {"Reviewer": "Don Terry", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 199, "Tequila": "Fortaleza Añejo", "Rating": 75, "Review": "Lot 34|sarsaparilla nose. entry tastes like mouthwash, metallic and medicinal. bitter finish, with top note of sweet vanilla, an odd combo which doesn't work for me.", "Recommend": 1}, "50": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 35|Lot 35. Lot 35.", "Recommend": 1}, "51": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 34|Lot 34.", "Recommend": 1}, "52": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 29|Lot 29. Always expect good things from Fortaleza and this does not disappoint... Oily mouthfeel , smooth and a tad mellower compared to lot 25!...", "Recommend": 1}, "53": {"Reviewer": "Rambo Serrato", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 207, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "of the 3, this is bold leader.  the man of the house. but he wears custom suits, drives a jag, and loves the ladies. not tough. ... experienced and smart. big vanilla on the nose.  sweet, inviting,  not at all intimidating.  this bottle should come with a bear - skin rug and a fire place. pepper, mint,  honey and molasses splash around in a dance upon your taste buds, before giving you a sample of smoke before disappearing.Rosa Mexicana,  DCtall shot glass$13tres enchiladas", "Recommend": 1}, "54": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 26|Toasting Rick and Michelle's wedding. Salud!!", "Recommend": 1}, "55": {"Reviewer": "Gregg Time and Tequila", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 128, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 28|Lot 28. Heavy caramel notes, some vanilla and booze. Agave on the flavor and some pepper finish. So nice", "Recommend": 1}, "56": {"Reviewer": "Paul Cooke", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 109, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 18|Lot 18.", "Recommend": 1}, "57": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 25|Lot 25. Lot 25. Lot 25.", "Recommend": 1}, "58": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 12|A gift from a friend, this Lot 12 a√±ejo is superb with roasted agave and barrel spice on the nose and a great mouthfeel that is never thick or cloying on the tongue. Some alcohol numbing and what I call rustic elements in the finish and after add to the artisan aspects that make this tequila great from batch to batch. It tastes hand made because it is.", "Recommend": 1}, "59": {"Reviewer": "Craig Macadang", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1253, "Tequila": "Fortaleza Añejo", "Rating": 84, "Review": "Lot 19|Lot 19", "Recommend": 1}, "60": {"Reviewer": "Rick  Young ", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 214, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 26|Lot 26.", "Recommend": 1}, "61": {"Reviewer": "Craig Macadang", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1253, "Tequila": "Fortaleza Añejo", "Rating": 82, "Review": "Lot 22|Lot 22", "Recommend": 1}, "62": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 19|Lot 19. Bit paler in color and taste than lot 18 but still amazing like it a lot!", "Recommend": 1}, "63": {"Reviewer": "Paul Cooke", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 109, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 12|Lot 12.", "Recommend": 1}, "64": {"Reviewer": "Craig Macadang", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1253, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 18", "Recommend": 1}, "65": {"Reviewer": "Steven Albrecht", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 230, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 19|Lot 19. Lot 19.  Wonderful balance of agave, wood and spice  ", "Recommend": 1}, "66": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 18|Lot 18. Lot 18.Blind tasted interesting depth of flavour. Full flavored!.. Like it a lot!!!", "Recommend": 1}, "67": {"Reviewer": "Tommy Grules - Los Skeletone Blues Band ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 196, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Tasted blind !..Interesting depth of flavor! Full flavored ...Like it a lot!.. Best Anejo!", "Recommend": 1}, "68": {"Reviewer": "Oscar \"Ozzy\" Fabian ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 164, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 08|Lot 08.", "Recommend": 1}, "69": {"Reviewer": "Francisco Garcia", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 144, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 18|Lot 18.", "Recommend": 1}, "70": {"Reviewer": "Charlie Cupp", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 247, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 18|Lot 18. Lot 18.", "Recommend": 1}, "71": {"Reviewer": "Rick Levy", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 276, "Tequila": "Fortaleza Añejo", "Rating": 78, "Review": "Lot 18|Lot 18. Lot 18.", "Recommend": 1}, "72": {"Reviewer": "Rick Levy", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 276, "Tequila": "Fortaleza Añejo", "Rating": 83, "Review": "Lot 16|Lot 16. Lot 16.Tasted before and after aeration. I'm not hit with the huge rich vanilla and caramel that I have gotten from other lots, but when it opens up, they present themselves nicely with a hint of smoke. This is not as sweet as other lots, and some may find that preferable, perhaps more refined.Purchased at Old Town Liquor $90 (1.29)", "Recommend": 1}, "73": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "I would rate this a 10 for value if it weren't for the $129 before tax price in WA state. They sold so much at $109 (sarcasm) the distributor needed to raise the price over $20 per bottle. I shop online for this now or mule it back myself from CA.", "Recommend": 1}, "74": {"Reviewer": "Don Terry", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 199, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 13. Big, sweet nose with tons of butterscotch, honey and some pineapple mingled with agave. Lots of barrel notes on the palate, including vanilla, caramel and butterscotch, but with a nice oaky bite at the end to balance it out. This is such an easy sipper, highly recommended!", "Recommend": 1}, "75": {"Reviewer": "Charlie Cupp", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 247, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Cuban Cigar Compatible.....Tip Top Sipper", "Recommend": 1}, "76": {"Reviewer": "Rick Levy", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 276, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "I think this might have been lot 14 or earlier. It was in a restaurant, so I didn't get the lot #.", "Recommend": 1}, "77": {"Reviewer": "Adam Stemmler", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 326, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 12|orange marmalade, nutmeg, caramel", "Recommend": 1}, "78": {"Reviewer": "Khrys Maxwell", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 161, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 02|Los Abuelos (aka Fortaleza) añejo lote 2 (bottle number 00595) is a really beautiful añejo in that it has a ton of earth, minerals, and cooked agave tones with some nice warm butter and spice from the barrels. It is much more agave forward than any of the current Fortaleza añejos, which are a bit more oak forward, but just as delish! \r\r If you can find some of this vintage tequila, taste it - you will never forget it!", "Recommend": 1}, "79": {"Reviewer": "Chris Ancell", "Reviewer_Level": "Tequila Badass", "Ratings_Given": 414, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 09|Aroma of sweet butterscotch. Great flavored spicy butterscotch. Finish of butterscotch lingers sweetly across the mouth.", "Recommend": 1}, "80": {"Reviewer": "Grover Sanschagrin", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1019, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Citrus deliciousness! Baked agave, vanilla, slightly spicy. This is a delightful long-term sipper. This is a unique tequila experience.", "Recommend": 1}, "81": {"Reviewer": "Tapley Richards", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Butter. Flower. Tannin", "Recommend": 1}, "82": {"Reviewer": "Jerrett Wichman", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 45, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 42|Nose cooked agave nutmeg and a bit of a cheesy funk barrel roomTaste. Cooked agave. Vanilla and butterscotch Finish. Long and lingering. You get a bit of a peek at what a Fort XA would look like. GES just can’t seem to keep enough in barrels. Lol.", "Recommend": 1}, "83": {"Reviewer": "Jeremiah Ingram", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 59 drinks amazingly well as a dessert sipper. It's the best anejo I've had.", "Recommend": 1}, "84": {"Reviewer": "Jalen Berry", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 64|I smell a huge butterscotch note just right off the jump, with this mellow hint of vanilla. The taste is amazing with notes of vanilla, light oak, butterscotch, and the sweet agave.", "Recommend": 1}, "85": {"Reviewer": "Jamie Dorland ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 13, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 60|Lote 60-A: I had to regrade after 6 months, it aged extremely well. Nose is creamy buttery with slight earthy agave. Taste is very smooth, lost the heat on the entrance with silky creamy texture with caramel and cooked agave. Tad bit of heat on the back end. Delicious!", "Recommend": 1}, "86": {"Reviewer": "Laraine Gomes", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 39, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "almost graduates to non tequila because it's so smooth.strong agave taste but not harsh", "Recommend": 1}, "87": {"Reviewer": "Nicholas Carter", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "wood shows strongly on the taste", "Recommend": 1}, "88": {"Reviewer": "Bo Pierce", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "cooked agave, black pepper, stone, honey", "Recommend": 1}, "89": {"Reviewer": "Sam Tequilazo", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 22, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 57|Sweet balanced caramel oak cooked agave vanilla cotton candy earthy floral cajeta Dulce", "Recommend": 1}, "90": {"Reviewer": "Tom Rickling", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 85, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 42|Amazing!!! Buttery vanilla goodness… a must if you have the opportunity!", "Recommend": 1}, "91": {"Reviewer": "Rodrigo Torres", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 23, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "color:clearer for an añejo, not additivesaroma:butter, softtesttaste:tastes fun. butter, elegant sweet (vanilla, cinnamon)finish:long, gentle, smooth~80'secspersonal:Definite BUY", "Recommend": 1}, "92": {"Reviewer": "Peo Zetterdahl", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 62|On the nose I get the agave, fruit, olive, oak, cinnamon and citrus. On the lips its cristal clear like spring water. Very smooth. On the palet I get the agave, pepper, oak, fruit then olive and citrus. In the aftertaste I get buttery tofe. Very nice tequila. A favourite.", "Recommend": 1}, "93": {"Reviewer": "Marcos Liang", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 130, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 41|Color is light yellow.Nose: light sweet cooked agave, very light camphor wood, touch of vanilla, resinous, menthol.Palate: sweet cooked agave! Minty, mineral, although wood is not perceived on nose, it is slightly in mouth, Finish is medium to long, sweet cooked agave with camphor wood aroma persist, at the very end it is slight astringent & dry.", "Recommend": 1}, "94": {"Reviewer": "Marcos Liang", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 130, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 42|Color: yellow.Nose: intense sweet cooked agave! sweet wood notes, camphor wood, mineral, menthol, fresh, hint of vanilla.Palate: aromatic camphor wood with sweet vanilla, sweet cooked agave, caramelized sugar sweetness,  menthol, fresh, not cloying, good sweet & sour balance, Finish is medium to long, sweet cooked agave and sweet camphor wood dominate. At the very end dry wood aromas emerge too. After 30 minutes in the glass the wood notes start overpowering agave sweetness.", "Recommend": 1}, "95": {"Reviewer": "Alex Padilla", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 87, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 63|Actually having lote 63a and 59a side by side. I’ve had bottles of 59a and have been sipping it but have never rated the añejo. Lote 63a is noticeably darker than 59a and other bottles I’ve seen, what caused this I do not know (longer aging, newer barrels, etc?). This review is for 63aAroma: right off the bat a blast of agave followed by oak and then caramel. Taste: Cooked agave followed by butterscotch, oak, pepper, cinnamon. Finish: just agave for minutesOverall 59a is still great, it’s just a little bit more subtle with more oak flavors. 59a would be an 89 for me.", "Recommend": 1}, "96": {"Reviewer": "David Quintana", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 62|The bouquet alone tells you it is something special.  The sip is smooth but bursts out flavor that has little burn and envelopes your taste buds.  The cost is a bit high for my usual budget but it reminds you that this is an excellent tequila to share with good friends and family. Using it as a mixer feels like a sin but I imagine it would make some amazing drinks.", "Recommend": 1}, "97": {"Reviewer": "Armando  Aguilar ", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 42, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 63|Wow! The hipe is real! This has the flavor profile of an XA. Lote 63", "Recommend": 1}, "98": {"Reviewer": "christine h", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 202, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 62|Fortaleza Añejo lote 62had this at Mi Tierra in Monroe 10/22/22nose: right off the top green apples, agave, cinnamonpalate: agave caramel cinnamon finish is warm and sweet excellent lote!!!", "Recommend": 1}, "99": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 61|Lote 61 the last of three side by side tastings of Añejo during our Fortaleza Saturday. Fun tasting everyone thanks!", "Recommend": 1}, "100": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 49|Fortaleza night! The first of three batches! Delicious!", "Recommend": 1}, "101": {"Reviewer": "Andrew Bishop", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 74, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 63|Notably oakier than lot 61 (my personal favorite), but still a remarkable bottle.", "Recommend": 1}, "102": {"Reviewer": "Steve Lere", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 145, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 63|lote 63", "Recommend": 1}, "103": {"Reviewer": "christine h", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 202, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 43|Fortaleza does not disappoint. I have had several lotes of this over the last 10 or so years but didn't know to keep track. Nose: Sweet agave maple banana a little oak some butterscotch vanilla barrel spice Palate: agave oak vanilla a little pepper/heat in a good way Finish: medium/long, warms the throat Nice legs, very well-balanced as we expect from a Fortaleza product.Updated Dec 2, 2022tried lote 63A a few times. really liking it but my tasting notes are lost so i need to wait til i revisit. Again tasted Oct 18, 2022Fortaleza Añejo Lote 43A Nose: agave little oak vanilla barrel spice banana/bubblegum little cinnamon on bottom nose. John says mint. I didn't get mint; he didn't get cinnamon.Palate: agave heat vanilla little bourbonFinish: really nice finish, a little agave, a little heat and it stays with u for a bit Overall, Fortaleza Añejo has been (since 2013) and continues to be one of my top 3, maybe #1 añejos ever. Fortaleza does not disappoint. Ever. Never. This anejo is so well-balanced. It sets th bar for every tequila", "Recommend": 1}, "104": {"Reviewer": "Patrick Todd", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 52, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 61|Nose: agave, damp barrel, woodFlavor: agave, oak, slight sweetnessFinish: crisp, coats your mouth perfectly", "Recommend": 1}, "105": {"Reviewer": "Kyle Dickman", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 34, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Nose: Malt vinegar, citrus, smoke, agaveTaste: Caramel, smoke, citrusMy favourite so far. Whiskey notes, while still retaining its Tequila essence.$23/oz", "Recommend": 1}, "106": {"Reviewer": "Brandon Ortiz", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 2, "Tequila": "Fortaleza Añejo", "Rating": 85, "Review": "Lot 56|Nose:Sweet caramel with oak and cooked agave Flavor:Aged oak with a warm spice flavor over the agave flavor. Smooth finish with no real alcohol bite more of a spiced finish", "Recommend": 1}, "107": {"Reviewer": "Josh  Miller", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 84, "Review": "Lot 59|Heavy vanilla, agave, more vanilla!", "Recommend": 1}, "108": {"Reviewer": "slowsip jerek", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 13, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 63|Lote 63-A", "Recommend": 1}, "109": {"Reviewer": "Shane Thompson", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 60|For the nose I get agave with a mix of sweet caramel and delicate vanilla rounded out with a nice smoky oak and a hint of pepper. For the taste I get agave, oak, and vanilla up front with a butterscotch peppery finish and a honeyed mouthfeel at the very end.", "Recommend": 1}, "110": {"Reviewer": "Lorenzo  Benvenuto", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 9, "Tequila": "Fortaleza Añejo", "Rating": 99, "Review": "Lot 58|the hype was real. This is divine. It’s complex, but sweet enough, with an enveloping taste of cooked agave. I still have to work on the after-taste tasting notes. Overall it is ambrosia. Too bad that it costs a leg in europe.", "Recommend": 1}, "111": {"Reviewer": "Lauren Castano", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 39, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 59|A lot of cherry, pear, butter with a long, warm & silky finish. Loveee", "Recommend": 1}, "112": {"Reviewer": "Andrew Bishop", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 74, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 61|Beautiful notes of vanilla and caramel in the aroma. The flavor matches the aroma’s vibrancy, with strong flavors of cooked agave still present. This añejo anchors the Fortaleza lineup, which I believe is the gold standard of the industry.", "Recommend": 1}, "113": {"Reviewer": "Nick Puente", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 29, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "Lot 62|Lot 62-AVanilla, caramel, cherry, and pear on the nose. Really nice, rich aroma in the glass. Same flavors when sipped. Incredibly warm and smooth to drink. Hands-down my favorite tequila. Can't say enough good things about this añejo.", "Recommend": 1}, "114": {"Reviewer": "Mateo Hall", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 20, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 62|Color is amazingly bronze. Aroma is rich with caramel, cinnamon, and creme brulee. Flavor follows suit adding cooked agave and baking spices. Easy finish, with no lingering alcohol.", "Recommend": 1}, "115": {"Reviewer": "Robert Siebelink", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 60|Smooth", "Recommend": 1}, "116": {"Reviewer": "Mateo Roberto ", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 41, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Delicious cooked agave, oak, cinnamon, spice, vanilla. Very complex. Lingering finish. Nice aroma. Good price for such an excellent añejo. Brand story is unique. Terrific recycled glass bottle. Def a must for your agave spirits collection. ", "Recommend": 1}, "117": {"Reviewer": "Nick Shurgott", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 58, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "Lot 28|Lot 28. Caramel on the nose like no other tequila I’ve had before. Fantastic anejo well worth the money if you can find it. Enjoy!", "Recommend": 1}, "118": {"Reviewer": "Jack Stewart", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 34, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Tasted at Chucherias Hondurenas in Daytona Beach, Florida", "Recommend": 1}, "119": {"Reviewer": "Peter Pablito", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 60|Lote 60a", "Recommend": 1}, "120": {"Reviewer": "Joseph Barone", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 55|Very very tasty. Extremely smooth goes down like water. Agave with vanilla. Sweet aftertaste but not too sweet. Slightest hints of wood and white pepper. Can see why this is so highly rated. Worst thing is the cork.", "Recommend": 1}, "121": {"Reviewer": "t k  [little_agave]", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 219, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 43|43a   gah delicious", "Recommend": 1}, "122": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 62|Tasted at La Cava Fortaleza jume 2022 con mi hermano. Gracias team Los Abuelos!", "Recommend": 1}, "123": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 60|A little thinner than usual. I compared it to some lote 53 that I had on hand. Definitely the aroma is less sweet and full of yummy Fortaleza flavors.", "Recommend": 1}, "124": {"Reviewer": "Andre Malske", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 93, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "This one is one of the finest: unmistakably anejo tequila. Flavorful, smooth, nothing artificial about the flavor. I’d say it a pricier Anejo, but worth it for your collection.", "Recommend": 1}, "125": {"Reviewer": "Mitch  Peabody ", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lote 61a", "Recommend": 1}, "126": {"Reviewer": "Jason Goldstein", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 59|Cooked agave, fresh vegetables, smooth, less spice and burn than blanco. Toasted oak on lips. Vanilla/oak on the finish. Complex.", "Recommend": 1}, "127": {"Reviewer": "Juan Velázquez", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 50|Easy to sip tequila. This is the big daddy of tasty, yet “smooth” tequila.", "Recommend": 1}, "128": {"Reviewer": "Joel Rojas", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 155, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "So good, easy and effortless to drink with that Oakey, bourbon, agave, spice all mixed together comes through strong. Buttery and oily, sticks to the tongue and doesn’t let go. Nice Smokey like finish for me. Long sticky legs on the glass, looks very cool looking through the glass at a light source. Huge thumps up on this one. Fortaleza never disappoints.", "Recommend": 1}, "129": {"Reviewer": "Archie Brown", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 353, "Tequila": "Fortaleza Añejo", "Rating": 84, "Review": "Lot 59|Very light. Nice silky mouthfeel. Taste of agave, caramel, black pepper, licorice, slight vegetalness", "Recommend": 1}, "130": {"Reviewer": "Anthony  Capaldi ", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 35, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 60|Another wonderful Tequila from Fortaleza.   great nose and taste. flavor of barrel comes through on the finish. love this in my tequila glass after a long day.  Hopefully they'll make an extra anjeo in the future.  Salud", "Recommend": 1}, "131": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 55|Lote 55a at DQJ in Tlaquepaque. The best aroma in all of tequila!  Still magic. Taste and finish are sensational as always. ¡Que mágico!", "Recommend": 1}, "132": {"Reviewer": "Sharon Olivo", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 116, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Los Abuelos DisteleriaAfternoon sipping with Guillermo and tour group. I don’t care much for Añejo but this one was sippable for me. Enjoyed it with a sweet flan-like dessert.", "Recommend": 1}, "133": {"Reviewer": "Fred Zammataro ", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 56, "Tequila": "Fortaleza Añejo", "Rating": 83, "Review": "This Anejo is lighter in color indicating that it was not in barrel that long, or the barrels were well used. Pleasant agave aromas and rather subtle, yet pleasant secondary and tertiary notes of herbs and spices. Lacks much of the aged notes that I desire, like maple, caramel, butter etc. Overall, pleasant but not the top of the pack.", "Recommend": 1}, "134": {"Reviewer": "Clay Fullick", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 13, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 59|Great drink. I like Reese’s pb cups and to me, this is the Reese’s pb cup of tequila. No it doesn’t tastes like a Reese’s but let’s just say I’ll never turn one down….and yes it pairs amazingly with one.", "Recommend": 1}, "135": {"Reviewer": "Shawn Miller", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 80, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Blind Rating: Clearly aged. For me a good amount of barrel. Excellent tequila.  A touch hot on the finish but then really nice on the backend of the heat. And nice long finish. No funk, this is good tequila.", "Recommend": 1}, "136": {"Reviewer": "John Spinale", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 88, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 60|this is the best tequila I've had to date. it's basically the perfect tequila for me. it hits all the notes: it's an agave bomb, while also being extremely smooth, round, textured, multi-dimensional, and has amazing barrel flavor. hard for me to top this one.", "Recommend": 1}, "137": {"Reviewer": "Noah Hamilton ", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "Lot 59|Nose: Smokey agave, lemon, oak, butterscotch (slight)Mouth Feel: buttery smooth, rich, fullTaste: Agave, oak, pear, citrus fruit, pepper, cinnamonFinish: long and smooth,  no ethanol, oak and agave linger favorably, lemon grass", "Recommend": 1}, "138": {"Reviewer": "Catherine  Martin @tequilarankings", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 78, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 56|Aroma- cooked agave, dried fruitTaste- cinnamon, cooked agaveFinish- smooth, agave, cinnamon", "Recommend": 1}, "139": {"Reviewer": "Kary Millet", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 35, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 60|This is a good tequila. Smell is agave and alcohol. Sometimes I can get lots of flavors — agave, butterscotch, alcohol, Oak, caramel, alcohol, pepper, dry bitter tannin, alcohol, butter, Chardonnay, cinnamon, earth, smoke, alcohol, licorice. I would never say no to a glass of fortaleza… but… mostly there’s a golden champagnesque Alcohol flavor that hits the pallet over and over between the other flavors. Very good but not my favorite. For complexity I want to give this a 90. For the alcohol taste, I want to give this an 80. Makes it tough to score.", "Recommend": 1}, "140": {"Reviewer": "Paul Van Berkel", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 49, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 60|Heavy agave and oak flavors. Great after flavor. Nice vanilla notes come late on the back of tongue.", "Recommend": 1}, "141": {"Reviewer": "Steve Inganamort", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 34, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 59|Beautiful caramel finish. The wood is present throughout. Mineral flavors.", "Recommend": 1}, "142": {"Reviewer": "Jonathan Webb", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 97, "Review": "Lot 60|Citrus vanilla", "Recommend": 1}, "143": {"Reviewer": "Alfonso Esquivias Gonzalez", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 107, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Chocolate & Oaky!! Delicious. Subtle oaky finish.", "Recommend": 1}, "144": {"Reviewer": "Brad Mason", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 118, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 55|$150Licorice", "Recommend": 1}, "145": {"Reviewer": "James Graham", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 4, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 60|The smell on this is off the charts amazing. The drinks is full and sweet with notes of wood that don’t overpower.", "Recommend": 1}, "146": {"Reviewer": "Hugo Diaz", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 33, "Tequila": "Fortaleza Añejo", "Rating": 97, "Review": "Lot 50|Lot 50", "Recommend": 1}, "147": {"Reviewer": "Zindy Morado", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 67, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 112-B Sugar cane, herbs and buttery finish", "Recommend": 1}, "148": {"Reviewer": "Steven Loya", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Often times with anejos, you can lose the agave. Not here. Strong agave presence, but also caramel and vanilla. Barrel is definitely there but not overpowering. Spicy but in all the best ways as its so easy to sip. Buttery and rich finish. Excellent tequila!", "Recommend": 1}, "149": {"Reviewer": "Nathan  Duck", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 81, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "The smoothest Anejo I’ve had, it’s not too smooth tho, it’s just right. It’s fresh, it’s vegetable, such good agave on this. The barrel doesn’t cover up the agave flavor.", "Recommend": 1}, "150": {"Reviewer": "Scot Stetson ", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 283, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Rich & creamy. Lots of agave,  raw & cooked. A spicy, citrus, carmel in the taste. Finishes with butter, barrel spices and toffee.", "Recommend": 1}, "151": {"Reviewer": "Frank Galvez", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 88, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 59|Fortaleza Añejothe nose is a great blend of cooked agave,  great notes of oak barrel, vanilla, candy yams, kiote, minerals, raisins, dates, fruit cakethe palate is a delight all the great flavors of the Instaglam fancy bottle stuff minus the additives and the awesome minerals. the oak, vanilla, papaya, banana dessert flavors are a blast.the finish makes me feel like a just smoked a montecristo. soo complex..im big on high proof blancos. considering that, this is the best añejo I've had, to date .", "Recommend": 1}, "152": {"Reviewer": "Daniela Pedraza", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 59|nose: immediately, i get a rich mineral scent along with some sea water. i smell hints of caramel and vanilla underneath a citric floral scent. taste: wonderful buttery viscosity coats your tongue gently. definitely get that rich mineral taste. it’s like a mineral flavor that your body naturally craves because it has vitally important nutrients in it. a delicate touch of vanilla and caramel as noted earlier. the caramel comes through as you start to push the tequila from the front of the mouth to the back of the mouth. on the swallow, it’s sweet and refreshing. it has a small bite to it if you drink it too fast but wow what an amazing tequila. this is my first bottle of fortaleza and i am so wickedly impressed. people do not overhype this tequila, it’s delicious and traditionally made!! no additives!! love it.", "Recommend": 1}, "153": {"Reviewer": "Derek Beumer", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 54, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 59|Lot 59-A. The overwhelming smell is green olive and brine. A whiff of ethanol. A faint hint of vanilla.Pleasant soft and viscous mouthfeel as it hits the tongue. Taste is fronted by cooked agave, green beans, pepper, and orange peel in that order.Aftertaste finds the oak coming to the forefront, followed by a peppery kick that ramps up slowly in the back of the throat.My absolute favorite anejo at the moment.", "Recommend": 1}, "154": {"Reviewer": "john rumm", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 150, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 37|dangerously very tasty.", "Recommend": 1}, "155": {"Reviewer": "Frank Galvez", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 88, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 51|Fortaleza Añejonose is smooth like suade, notes of oak/cedar, clean cooked agave,citrus, lemon/pink grapefruit, anise, and dry fruit.full flavor roasted agave, barrel beautiful chest heat,, nice oily mouth coat, vanilla, caramel, cinnamon, over ripen mangoes and apricot. a nice cheese/yeast/mushroom finish", "Recommend": 1}, "156": {"Reviewer": "Alvaro Sanchez", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 4, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Favorite tequila out there. Unique, pure. Not very many tequilas are still made the old fashioned way like this. You get to smell and taste on the palate the cooked, Smokey agave.", "Recommend": 1}, "157": {"Reviewer": "Rod Adams", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 94, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 48|Nose of oak, baked agave, honey and brown sugar. Rich thick mouthfeel…. Honey butter, vanilla wafer, oak, toffee flavors. Long peppery finish with hints of toffee and faint citrus. Damn fine Anejo.", "Recommend": 1}, "158": {"Reviewer": "Mackenzie Wheeler", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 34, "Tequila": "Fortaleza Añejo", "Rating": 85, "Review": "Lot 52|The nose is delicate but not lacking in aromoas.  A great balance of cooked agave, barrel influence (oak, allspice, cedar, and butterscotch), and tropical fruit (pineapple and banana).The taste still has so much cooked agave flavour.  Noticeable flavours of oak  vanilla, black licorice, and overripe fruit (a little reminiscent of a high ester Jamaican rum).The finish is medium in length with lots of oak characteristics.  At nearly $200 Canadian, it's tough to recommend Fortaleza Anejo (this is the biggest knock against its score).  If you can find it south of the border for a fair price, grab a bottle.  Otherwise there are better buys.", "Recommend": 1}, "159": {"Reviewer": "Jacob Hawthorne ", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 58, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 56|AromaVanilla and oak, followed by cooked agave, and chocolate.TasteButterscotch and vanilla followed by chocolate, caramel, cooked agave and oak.", "Recommend": 1}, "160": {"Reviewer": "Frank Diniz", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 61, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 55|Lote: 55A, Lots of tannins from what tastes like overly reused casks coming through, probably more re-re-reused casks in this lot.  I get the fantastic signature aromas and flavors as excepted but… I get drying bitter tannins (bitter wet wood smell and taste) coming through at the beginning and lasting through the very end of the finish from what I expect are from excessively reused casks and is a bit off putting.", "Recommend": 1}, "161": {"Reviewer": "David Gleason", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 287, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Had at the cave at the distillery.  The oak and agave blend well.  I think the balance of the product is what shines through.  Spend money and treat your self.", "Recommend": 1}, "162": {"Reviewer": "Mark J Copeland", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 63, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 53|Very strong clean smell catches up", "Recommend": 1}, "163": {"Reviewer": "Matthew Sanders", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 54|Lot 54, This taste amazing! I love the barrel influence with Fortaleza. I feel like their aged expressions are definitely agave forward, but with noticeable caramel, vanilla, and butterscotch as well. Maybe their barrels are freshly recharred.", "Recommend": 1}, "164": {"Reviewer": "DJ ANIMALE ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 170, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "The Pinnacle of Tequila", "Recommend": 1}, "165": {"Reviewer": "David Hanks", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 56|As someone who is newly exploring tequila, and someone who has favored whisky almost their entire life, I’m not ashamed to say that this is one of the greatest spirits I have ever tasted. It just blows me away to think that tequila like this has existed as long as it has, and like a fool I have been reluctant to explore the spirit because I didn’t think I could find something that would match with my palate.The nose: Heaps of heavy citrus. It almost reminds me of lemon rinds. Very simple, but not overwhelming. Unlike anything I’ve ever smelled from any other tequila of this type. Most Añejo’s tend to have heavy sugar saturated tones like butterscotch or vanilla, but the agave is clearly still the star here as it should be.The palate: There is so much minerality and earthiness upfront! It’s very fresh, and crisp. Again, lots of citrus notes, a slight wood tone and some mild sweetness on the finish. My only complaint is how pricey this bottle can be, and how difficult it has been for me to track down. At upwards of $80-$90 it can be a hard sell, but compared to any other tequila at or above this price range, you’d be hard-pressed to find a spirit of this quality. If you’re considering it, I would absolutely jump at it. Like now. Seriously. This tequila may very well have converted me over.", "Recommend": 1}, "166": {"Reviewer": "Stephen Marsh", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 85, "Review": "Lot 48|nose: vanilla, stone fruit, brown sugar, flan. AMAZING nose. Taste: wheated bourbon, mild, sweet; not too viscous mouth feel; really nice (not complex.) Finish: mild; not notable, but pleasant. Caramel. It's not adventurous or intriguing, but solid and lovely.Though I do really like this, I don't totally see why I wouldn't just have a bourbon if I wanted these flavors. I would drink this again, but I wouldn't pursue it, nor buy a whole bottle for myself. It basically tastes somewhere between Eagle Rare and a Knob Creek.", "Recommend": 1}, "167": {"Reviewer": "A. Sol L. Fenix", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 84, "Review": "Flavor of agave, oak, fruit, mild sweetness.", "Recommend": 1}, "168": {"Reviewer": "Stanley Janicki", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 103, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Really an incredible agave forward product! So many aged products lose the agave flavor but not here! So great how it blends the oak and vanilla into it", "Recommend": 1}, "169": {"Reviewer": "David Gallagher", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 53|Nearest I have tasted to a whiskey of all the anejo I have tried. I enjoyed it personally more with a touch of water.", "Recommend": 1}, "170": {"Reviewer": "Steve Bruer", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 53|Cinnamon, Pepper, Oak, Alcohol", "Recommend": 1}, "171": {"Reviewer": "Danielle Muzyka", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 91, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 52|Agave and Caramel on the noseSweet, round, caramelBit of oak.Peppery finish.", "Recommend": 1}, "172": {"Reviewer": "isaac vasquez", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 31, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "lo probe en el restaurant Latequila en guadalajara, esta exquisito, muy suave sabor no saturado a roble, muy facil de pasar, agave cocido, citrico, manzanas y peras, y un toque leve de miel y vainilla, lo recomiendo!", "Recommend": 1}, "173": {"Reviewer": "Carlos Garmendia", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 54|Almonds", "Recommend": 1}, "174": {"Reviewer": "Evan van Dun", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Great overall anejo. I do think the blanco beats this out, but that doesn’t diminish its grand taste. Solid overall.", "Recommend": 1}, "175": {"Reviewer": "Richard  Gonzalez ", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 1, "Tequila": "Fortaleza Añejo", "Rating": 85, "Review": "Lot 52|great, sweet aroma. lots of butterscotch. quite a bit of oak on the palatte", "Recommend": 1}, "176": {"Reviewer": "Kristen Dhanekula", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Smooth, rich, & complex sip. There's a buttery richness up front and subtle cinnamon & banana end notes.", "Recommend": 1}, "177": {"Reviewer": "TJ Matlack", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 52|Vanilla and buttery nose. Agave forward flavor. Slight earthiness. Light and refreshing.", "Recommend": 1}, "178": {"Reviewer": "Jace LeBrock", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "very hard for me to get my hands ... obviously I was very excited! very clean oak barrel nose...Like smelling delicious pipe tobacco as a child. You know this is going to be a pleasurable drink based on the aroma alone.  Creamy smooth with a gentle perfect burn on the finish... knowing this is additive-free and rooted in Tradition... this is truly as good as tequila gets!", "Recommend": 1}, "179": {"Reviewer": "Nick Andalora", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 245, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 52|Aroma of whiskey and sweet agave", "Recommend": 1}, "180": {"Reviewer": "Chad ", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 67, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 52|Very mild aroma. Soft and light on the palate with little to no oil on the profile. Balanced and smooth flavor with no harsh notes. Pleasant finish with a mildly spicy aftertaste. Very drinkable and a step up from Siete and Ocho.", "Recommend": 1}, "181": {"Reviewer": "Thom Tillier", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 159, "Tequila": "Fortaleza Añejo", "Rating": 84, "Review": "Lot 52|Has a whiskey finish..not as smooth as I was expecting, but this rating could change after another night with a fresh pallet.", "Recommend": 1}, "182": {"Reviewer": "David Cruz", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 28, "Tequila": "Fortaleza Añejo", "Rating": 99, "Review": "One of the best Tequilas on the market today. Flavor, Taste, Finish.", "Recommend": 1}, "183": {"Reviewer": "J Glen", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 56, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 52|Crisp and refreshing, smooth and delightful, the beauty of this Anejo shines though like a magnificent star. The aroma of the cooked agave pierces the nose and readies your tastebuds for a treat. The taste is pure heaven and has very little to none alcohol bite. The time, effort and tradition put into this bottle is priceless. Not a mixer at all, best enjoyed at room temperature with an open mouth glass, sip and savor. Well done. ", "Recommend": 1}, "184": {"Reviewer": "Eric Tamez", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Wow, this has such a great flavor profile with lots to unpack.  The nose is full of agave but trimmed with baking spices and some light oak. The flavor is not super maple like other Añejos but rather still keeps its agave and herbal notes true while still being very soft and full like an aged tequila. Love this bottle dearly", "Recommend": 1}, "185": {"Reviewer": "Neal Stack", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 4, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 52|Floral", "Recommend": 1}, "186": {"Reviewer": "Randy Smirnoff ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 106, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 50|Expected more wood/oak but pleasantly surprised that it was not overpowering with wood but really, really balanced with the agave and other aromas. About as perfect as an anejo should smell. Taste was lighter than anticipated but same as aroma but bigger payoff and complexity. The balance of wood and purity of agave and vegetal is such a treat it makes you want to giggle because it's what you thought an anejo should always have been. Clean, not over oily but strength of discernable craft. Finish as perfect as it gets. Glad I finally got to spoil myself because I deserve it!", "Recommend": 1}, "187": {"Reviewer": "Eleazar Vasquez", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 02|Agave, oak,", "Recommend": 1}, "188": {"Reviewer": "Brian Hye West Saloon", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 48|Lot 48Very soft. Some vanilla and pepper working well together.", "Recommend": 1}, "189": {"Reviewer": "Scott Norman", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 84, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 52|Inviting aroma of oak and vanilla but still picking up agave. Very well balanced flavor with nothing overwhelming or dominant. Just a nice blend of the barrel, the agave and soft sweetness. Some low lingering heat that finishes each sip.", "Recommend": 1}, "190": {"Reviewer": "Kirk Wallace", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 38, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 50|Very light aroma for anejo. Light citrus flavor with very little caramel finish. Smooth anejo.", "Recommend": 1}, "191": {"Reviewer": "Brian Robinson", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 88, "Tequila": "Fortaleza Añejo", "Rating": 80, "Review": "Lot 52|It’s good. But falls incredibly short of its panel and community rating. The panel likely adores it because it’s certified additive free and extremely light in every way. But for an Anjeo it fails. The barrel contribution is so minimized I would think it’s a Joven or maybe a Reposada. It’s soft, drinkable and .... meh, ok. When I buy Anejo I expect bold strong flavors... not here.Nose: weak tea and vanilla with some cooked agave.Taste: soft vanilla, cooked agaveFinish: nice cooked agave, some vanilla... and for once a bold cinnamon to black pepper finish.Biggest disappointment is the cost for what it is. I do love the bottle.I love the flawed hand blown distorted glass and the air bubbles in the glasswork.", "Recommend": 1}, "192": {"Reviewer": "Hugo Rex", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 50|Lot 50 Nose is citrus, vanilla and some pepper.  Palate is citrus, cooked agave, vanilla, cinnamon, and some pepper.  It finishes with more agave and vanilla", "Recommend": 1}, "193": {"Reviewer": "Danielle Muzyka", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 91, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Caramel, vanilla, very round.Smooth and sweet taste taste, good mouth feel.Leaves a bit of a film in the mouth.", "Recommend": 1}, "194": {"Reviewer": "Arthur Olvesen", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 13, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 52|On the nose there’s a ton of agave, some vanilla, and baking spices. On the palate, still a lot of agave, a hint of cinnamon, and vanilla. Super smooth. Really like this, but probably still prefer the blanco, as it’s perfection.", "Recommend": 1}, "195": {"Reviewer": "Sean Domen", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 4, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "The flavors and aromas of Fortaleza Anejo are like roasted hazelnuts with brown sugar, butter and cinnamon sticks - tossed onto a bed of morning dew grass with a light sprinkle of olive oil.", "Recommend": 1}, "196": {"Reviewer": "Richard Mendez", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 64, "Tequila": "Fortaleza Añejo", "Rating": 83, "Review": "Lot 49|This tequila has an agave and caramel aroma. The flavor is good with a lingering spice.I also can smell some vanilla after it sits in the glass. Overall this is a good sipping tequila. I do enjoy it.", "Recommend": 1}, "197": {"Reviewer": "Israel A", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 79, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "Lot 42|This is Lot 42", "Recommend": 1}, "198": {"Reviewer": "Luis Vieyra", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 44, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 43|Fortaleza 43aAfter hearing so many people raving about it I had my eyes open to see if I found any. And I did.Review 5/07/20First of all. This is something that even the dead’s have to taste it and let it run through their bones!Aromas it’s caramel, chocolate liquor lollies, cherry, red apples, tabaco, rocket melon, oak, leather, whiskey, coffee.It is definitely sitting in the side of the extra añejo more than añejo and that is because of the mix they did of their barrel of extra añejo and añejo. Therefore we are drinking an extra añejo for the price of an añejo. What a deal!Flavours are right on point with the aromas, leaving you a sweet long finish, that just keeps your tongue dancing to this sweet music.Great stuff.I do prefer the flavours of tequilas blancos than añejos but this is a dessert, a treat to have with a beautiful lady next to a chiminea!", "Recommend": 1}, "199": {"Reviewer": "William  Horvatin ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 123, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 46|Lot 46.  Nose is deep and complex.  I’m getting black licorice, maple, molasses, tobacco smoke, toffee, with a bit of barrel spice and rain with brine.  Taste is classic Fortaleza:  oily, rich, and sweet with a bit more barrel than the repo, surely...but not overdone.  A nice balanced anejo.  It finishes medium, takes its time, and the pepper bite fades nice and slow.  Nice thick oily legs too, thumbs up!", "Recommend": 1}, "200": {"Reviewer": "Joe Barraza", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 16, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 49|very good tequila. definitely alot better than reposado, although the repo is still good. I personally prefer Anejo over repo's. still a burn at first not to bad and the after taste is very good. very well made", "Recommend": 1}, "201": {"Reviewer": "Tom Spangler", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 30, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 43|Fantastic...absolutely love this Tequila", "Recommend": 1}, "202": {"Reviewer": "Eazy Breezy", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 75, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Aroma:  cooked agave, pineapple, vanilla", "Recommend": 1}, "203": {"Reviewer": "Harlan Burhans", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 14, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Happy Birthday to me... Love you Missy", "Recommend": 1}, "204": {"Reviewer": "Chris S", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 32, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 45|Agave is still there, amazing aroma and sweet taste from the barrels. Can't go wrong with anything Fortaleza makes!", "Recommend": 1}, "205": {"Reviewer": "R M", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 29, "Tequila": "Fortaleza Añejo", "Rating": 72, "Review": "Lot 46|Very gentle nose, agave, opening to floral, medium body, smooth entry, very light oak, surprised with other reviews, something must be way off with Lot 46A. Looks like some other folks rated lot 45 lower too.", "Recommend": 1}, "206": {"Reviewer": "Greg Duggan", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 109, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Pretty excited to finally add Fortaliza Añejo to the collection.This Anejo did not disappoint. The color is a nice amber with decent legs.Aroma is amazing, honey, butterscotch, agave are detected immediately.Flavor is over the top. Butterscotch, agave, pepper, citrus and spices.Finish is smooth with light pepper at the front of the pallet .", "Recommend": 1}, "207": {"Reviewer": "Daniel Ferguson ", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Great stuff", "Recommend": 1}, "208": {"Reviewer": "Bally  Boy", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 112, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 48|This is a very nice tropical sipper", "Recommend": 1}, "209": {"Reviewer": "Brian Westlake", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 12, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Aromas of vanilla, butterscotch, and cooked agave. I’m not a Anejo guy but this is pretty damn good. Their Blancos have similar aromas so you get consistent flavors and aromas across their brand.", "Recommend": 1}, "210": {"Reviewer": "Kemil  Gell", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 32, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 35|A balance of agave,spices,alcohol,sweet,pepper,light caramel and vanilla,finish on the aged run side to me sweet but hot cane", "Recommend": 1}, "211": {"Reviewer": "Cem Uras", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 16, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 46|Fortaleza is what tequila is. No cutting corners. Best taste. Looking forward to trying the winter blend reposado at a special occasion.", "Recommend": 1}, "212": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 47|Tasted at La Cava de Fortaleza. As usual exceptional. We were with some Fortaleza virgins who couldn’t believe it was tequila. They bought several bottles. Sensational tour with Miroslava who called TMM “tequila tinder”...very funny.", "Recommend": 1}, "213": {"Reviewer": "R. Raven", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 57, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 42|thank you fortaleza for Lot42a ..amazing.", "Recommend": 1}, "214": {"Reviewer": "James Shelby", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Very smooth. Has an almost buttery glide on your palate. Nice finish with some spice notes. Easy to sip on. Great sipping tequila. Price point is more than fair for a tequila of this quality.", "Recommend": 1}, "215": {"Reviewer": "Will McLean", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "I'm a rookie at this but the word that came to mind midway through my first glass was CLEAN. it's high quality stuff", "Recommend": 1}, "216": {"Reviewer": "Josh Dickman", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 70, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Wonderful aromas of roasted agave, caramel, and vanilla jump off the glass, followed by a mellow oakiness and a bit of fruit. Notes of black pepper, butter, cinnamon, and cherries also appear after opening up. The palate follows the aroma, with the addition of rich toffee and molasses. This is an excellent añejo, where the oak compliments the agave instead of overpowering it.", "Recommend": 1}, "217": {"Reviewer": "Drew Myers", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 89, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 48|Maybe I just really needed some tequila today but I am really enjoying this lote 48A. Wonderful balance between the agave notes and the oaks inulin with a bit of black pepper. Finish seeming to last for ages.", "Recommend": 1}, "218": {"Reviewer": "Martin  Bring ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 14, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 46|In a personal taste taste against Siete Leguas Anejo, the Fortaleza Anego is better IMHO. It is brighter, has more fruit, and is better balanced.", "Recommend": 1}, "219": {"Reviewer": "Richard Kotyluk", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 21, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 47|Mild fruit smell and taste", "Recommend": 1}, "220": {"Reviewer": "John Mehrkens (@jmehrk35)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 311, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 44|sweet baked agave hits upfront on the nose. so inviting makes you want to dive in. sweet ripe/overripe agave flavor. after the sweet agave enters the mouth, great ginger bread/carrot cake (no icing) take over on flavor. makes you fight over how much to smell or taste this great classic (close to perfection) anejo", "Recommend": 1}, "221": {"Reviewer": "brian kelly", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "My absolute favorite tequila. Everyone has their own certain preference for a style of tequila. Fortaleza is the perfect fit for my style.", "Recommend": 1}, "222": {"Reviewer": "Michelle Ramirez", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 4, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "outstanding", "Recommend": 1}, "223": {"Reviewer": "erick schneider", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "strong agave odorsmooth flavor with the right balance of sweet from agave", "Recommend": 1}, "224": {"Reviewer": "Angel Huerta", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 9, "Tequila": "Fortaleza Añejo", "Rating": 80, "Review": "Aromas of Carmel with hints of vanilla, flavors of burnt maguey and brown sugar, finishes with hints of smoke with a light hotness.", "Recommend": 1}, "225": {"Reviewer": "Kevin  Gonzalez", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 29, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 46|On the nose this tequila has a rich cooked agave with backdrops of caramel and vanilla followed by oak and barrel spice. Upon entry there is a beautiful cooked agave flavor which finishes with a smooth caramel. Overall this tequila is a simple but elegant tequila that focuses on the agave.", "Recommend": 1}, "226": {"Reviewer": "Tom Rickling", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 85, "Tequila": "Fortaleza Añejo", "Rating": 85, "Review": "Lot 44|Smooth sailing! Mild but good aroma w/ nice taste & mellow finish. :) $75ish", "Recommend": 1}, "227": {"Reviewer": "Cyrus  Thompson ", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 44|Flavor: Agave, Butter Scotch, Vanilla, Barrel Spice, Olive, Pepper", "Recommend": 1}, "228": {"Reviewer": "Bernie Gallegos", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 42|One of the best Tequilas I have drink. Was recommended by Emilio Ferreira  From el Búho Tequila store in Tlaquepaque a year agoGreat aroma vanilla smooth finish just amazing overall Thanks Emilio.", "Recommend": 1}, "229": {"Reviewer": "Stephen  Haines", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 47|This is one of the few Anejos that still retains a strong agave flavor! I prefer this to the over oaky Anejos out there.", "Recommend": 1}, "230": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 45|As usual this añejo is my favorite of all. Lot 45a is on par with others lots. So great.", "Recommend": 1}, "231": {"Reviewer": "Karin  C", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 181, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 45|Finish disappears in your mouth.", "Recommend": 1}, "232": {"Reviewer": "J. Puddybuc", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 9, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Expensive. I had to see why it’s so highly rated and it lived up to it. I brought it over with a bottle of Pueblo Viejo Anejo- My brother liked it better, My Pop didn’t. All said its a great tequila, but at $100...", "Recommend": 1}, "233": {"Reviewer": "Alex Bain", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 72, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 46|Peppery, fruity smell with a hint of caramel. Just the right amount of bite, and wow, what a smooth finish. I side with most others in saying this is a great Anejo.", "Recommend": 1}, "234": {"Reviewer": "John Stinson", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "NOM 1493|very oaky and a bit sweet with an externally smooth finish", "Recommend": 1}, "235": {"Reviewer": "Melanie Gordon", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 1, "Tequila": "Fortaleza Añejo", "Rating": 99, "Review": "NOM 1493|This was absolutely delicious! Be careful, with no after burn, it goes down like water!", "Recommend": 1}, "236": {"Reviewer": "Andy Van Gilder ", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 23, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 43|Incredibly smooth but great complexity.  It makes their Batch 44A Añejo experience more like a blanco by comparison. The story goes that Fortaleza lost this barrel for 2 years, so its essentially an Extra Añejo. It may be the only time to drink this aged tequila from Fortaleza so if you find it, drink it up!", "Recommend": 1}, "237": {"Reviewer": "Steve Lere", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 145, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|ditto with 42", "Recommend": 1}, "238": {"Reviewer": "Steve Lere", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 145, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 42|ok. strong roasted agave caramel vanilla spice chocolate some oak. very balanced great long finish. I guess it is my new favorite tequila", "Recommend": 1}, "239": {"Reviewer": "Karin  C", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 181, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 44|Earthy", "Recommend": 1}, "240": {"Reviewer": "Al Bundy", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 52, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 42|42/43 - very thick caramel", "Recommend": 1}, "241": {"Reviewer": "Dave Norwood ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 44|This is how a classic tequila should taste. The baked agave has a toasted flavor that is wonderfully full of flavor. It isn’t dominated by the flavors of wood and is perfectly balanced with a nice amount of agave.", "Recommend": 1}, "242": {"Reviewer": "hige oj", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 70, "Tequila": "Fortaleza Añejo", "Rating": 73, "Review": "normal but well balanced in high quality. so smooth.", "Recommend": 1}, "243": {"Reviewer": "Quinn Borland", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 71, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 42|The most seductive flavor I've cut into in a while. Chocolate, fruit, caramel and vanilla ring strong in this sweet indulgence. I felt the stress of my day melt away in this glass. This tequila deserves the hype and more. It may not be everyone's favorite but it's earned my spot.", "Recommend": 1}, "244": {"Reviewer": "Steve Lere", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 145, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 46|caramel cinnamon light oak spice some sweetness. doesn't get any better than this", "Recommend": 1}, "245": {"Reviewer": "Nicolas  G", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 9, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|Very good but needs to taste several times before loving it.", "Recommend": 1}, "246": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 44|Lote 44a. Fortaleza Añejo is my favorite ‘tequila treat’ ever. There is just something magical and wonderful about it. This batch is great. Full of flavor from aroma to the finish. I get more butterscotch in the aroma than other batches. So great!", "Recommend": 1}, "247": {"Reviewer": "Sarah Newland", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 41, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 43|Coconut, cantaloupe, hay, Carmel, smoke, baked sugar, cinnamon, oak, all spice, pumpkin", "Recommend": 1}, "248": {"Reviewer": "Tyler Summers", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 42, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|Carmel honey ", "Recommend": 1}, "249": {"Reviewer": "Tyler Summers", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 42, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 42|Carmel / ripe banana agave vanilla peppery finish on throat smooth mouth feel woody", "Recommend": 1}, "250": {"Reviewer": "Sarah Newland", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 41, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 42|Beach wood, vanilla, ripe cantaloupe, butterscotch, Carmel, cinnamon, vanilla ice cream, warm sunbaked wood, coconut, oak, banana, baked sugar,", "Recommend": 1}, "251": {"Reviewer": "Sarah Newland", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 41, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 41|Butterscotch, bourbon, minerals, cream, cinnamon, dry soil, aged wood,", "Recommend": 1}, "252": {"Reviewer": "Stan B", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 24, "Tequila": "Fortaleza Añejo", "Rating": 80, "Review": "Tastes really floral and grapefruit-ty.", "Recommend": 1}, "253": {"Reviewer": "Sean Aldrich", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 148, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 42|Everything is perfect .my highest rated tequila..Lote 42-A....", "Recommend": 1}, "254": {"Reviewer": "Jeff Hines", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 95, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 43A is an Anejo but contains XA juice.", "Recommend": 1}, "255": {"Reviewer": "Ken Fannon", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Excellent Tequila with a more traditional flavor and strong agave taste and nose. More vegetal than sweet in flavor", "Recommend": 1}, "256": {"Reviewer": "Jack Dweck", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 84, "Review": "Lot 37|Butterscotch and licorice with a nice citrusy finish.", "Recommend": 1}, "257": {"Reviewer": "Katherine Murray", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 43|Has a caramel taste and pineapple finish.", "Recommend": 1}, "258": {"Reviewer": "Sal A", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 99, "Review": "Lot 42|So I came across this holy grail lot 42. I bought both remaining bottles at my local Liquor store.  I decided to open one and save the other. All I can say is this tequila is amazing. It did not disappoint !!! I’m glad I bought both bottles. From what I have read on the internet this is a very special blend. The original añejo has been combined with some of the never release to public ( aka secret stash extra añejo). Some of the details are not clear but I guess there are sources that confirm this directly from the owner himself. Regarles this is some special tequila and I’m super happy I get to enjoy it. Salud And thank you Fortaleza you are my new favorito tequila !!!", "Recommend": 1}, "259": {"Reviewer": "Taylor Butel", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Vanilla, caramel, oak, borbon and earthy agave on the nose. The taste follows the nose pretty close in the order I listed with the earthy agave finish. This is a very nice Anejo!Lote 43-A", "Recommend": 1}, "260": {"Reviewer": "Chad C", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 41|I was lucky enough to have some lot 41A for my birthday. First time having any Fortaleza and I was blown away!  This was the best tasting tequila I have ever had. The aroma was amazing. Wow!  Thanks Martino for the good time!", "Recommend": 1}, "261": {"Reviewer": "Alex Atallah", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 117, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 43|Mostly similar to lote 42a except that 43a has more of a spicy kick and 42a is smoother. Like 42a a bit more.", "Recommend": 1}, "262": {"Reviewer": "Adam Duri", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 248, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 43|Lot 43, the unicorn. Cool experience to try an extra añejo mistake", "Recommend": 1}, "263": {"Reviewer": "Franz Swinton", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 344, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 43|The balance is quite amazing, nice heat and agave pepper through the finish.If you see this lot, get it.", "Recommend": 1}, "264": {"Reviewer": "Beau Lynch ", "Reviewer_Level": "Tequila Boss", "Ratings_Given": 557, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|Was lucky enough to score a couple of bottles of this from the distillery, amazing Tequila and probably my favourite (extra) anejo!!!", "Recommend": 1}, "265": {"Reviewer": "Mimilika Kessler", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 2, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 43|smooth, caramel, a little spice", "Recommend": 1}, "266": {"Reviewer": "Alex Atallah", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 117, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "Lot 42|Amazing stuff! Lot 42A takes all of those caramel, chocolate, pepper, and roasted agave flavors and is more mellowed and smoother due to the extra Añejo in the mix.", "Recommend": 1}, "267": {"Reviewer": "Steve Lere", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 145, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "butterscotch oak some pepper. great long finish. love this tequila lote 37", "Recommend": 1}, "268": {"Reviewer": "Rob Meyers", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 31, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 43|Oak doesn’t overpower the agave. Hint of butterscotch.", "Recommend": 1}, "269": {"Reviewer": "Tina Rukavina", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 38|Steve’s private collection.", "Recommend": 1}, "270": {"Reviewer": "Rigo Garcia", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 16, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|Leaves a little burn aroma to remind you it's tequila. Taste vanilla and oak, slight pepper.", "Recommend": 1}, "271": {"Reviewer": "Jason Spriet ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 43|Lote 43.  Worth it.", "Recommend": 1}, "272": {"Reviewer": "Sam Santerre", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 6, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 42|Wow this is good!", "Recommend": 1}, "273": {"Reviewer": "G Hay", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 128, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 38|Nose is sweet, light alcohol; on the palate butterscotch & caramel; rich undertones of honey on the backend; although price has increased drastically over the last 4 years, this is still a great value.", "Recommend": 1}, "274": {"Reviewer": "Sandeep Gupta", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 45, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 42|Very smooth", "Recommend": 1}, "275": {"Reviewer": "Juan Ocampo", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 56, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 42|Strong caramel aroma, peppery earthy flavors.", "Recommend": 1}, "276": {"Reviewer": "Jimenez Da Menaz", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 173, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 03|There’s a reason Fortaleza is among everyone’s top tequilas, it’s just pure tequila at its best.", "Recommend": 1}, "277": {"Reviewer": "Ken I.", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Seriously amazing. Believe the hype. One of my favorite anejos.", "Recommend": 1}, "278": {"Reviewer": "jeff davis", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "heavenlysmooth as silkpricey", "Recommend": 1}, "279": {"Reviewer": "Craig Hamilton", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 8, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 38|Very drinkable. Aftertaste turns to oak. Very distinctive. Quite different than other tequilas that I’ve tried.", "Recommend": 1}, "280": {"Reviewer": "Kevin DeLaney", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 63, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "vanilla and agave on the nose. a bit of cinnamon on a long finish. excellent sipper!!", "Recommend": 1}, "281": {"Reviewer": "Chuck Patton", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 35, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 35|The reposado is perhaps one of my favorites. Then anejo is outstanding as well. Great agave flavor, opens up to brown sugar, oak, and vanilla.  A champ! Will not disappoint.", "Recommend": 1}, "282": {"Reviewer": "Alex Atallah", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 117, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Tequila as it was meant to be. Notes of pepper, the agave nectar in my apartment, citrus, butterscotch, vanilla, caramel, Barrel spices, and chocolate. Has a similar taste profile to the Siete Leguas D’Antaño", "Recommend": 1}, "283": {"Reviewer": "Jeffrey Moore", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 18, "Tequila": "Fortaleza Añejo", "Rating": 96, "Review": "Lot 37|Wow. that's all I can say. a sweet but not overpowering flavor. hands down the best tequila I've tasted. drink neat only to truly experience it. im not sure that it's not a bit overpriced but if you can afford it, you should stock this so that you never run out", "Recommend": 1}, "284": {"Reviewer": "G Hay", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 128, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 15|Been sitting on this for years; Lot 15; Light on the nose; rich agave forward, vanilla & light fruit tones;  long, terrific finish across the palette, cannot recall the price point, but recall it was a good price back years ago;", "Recommend": 1}, "285": {"Reviewer": "T Quila", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 210, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 35|Difficult for me to locate, pricey to acquire.  Aroma soft and smooth, flavor multifaceted and with complexity and depth.  Finish nice.  Only two limiting factors here: availability (actually lack of availability here abouts) and the pricing.  My evaluation would be much better with much better pricing - but then I'd probably found none anywhere!  Sooo no complaints regarding the tequila itself.  I'll re-evaluate soon, but I do Love it ! ! !  No one would or anticipate or expect anything less with: Oven cooking/Tahona crushing and copper POTs!", "Recommend": 1}, "286": {"Reviewer": "Shahab Moradian", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "A very unique tequila w artisanal production techniques in full effect. Love the tasting notes of spice and bubble gum!!!", "Recommend": 1}, "287": {"Reviewer": "Alex Jackson", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 14, "Tequila": "Fortaleza Añejo", "Rating": 78, "Review": "Lot 38|With lime and water splash, this is fantastic. Without, it is a bit harsh.", "Recommend": 1}, "288": {"Reviewer": "winston tequila", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 37, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "these guys just make good tequila the old fashion way.  love all there stuff. really good and flavourful. ", "Recommend": 1}, "289": {"Reviewer": "Patrick Link", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "A beautiful añejo. Full but not overpowering. Rich without being too earthy. Nice long finish.", "Recommend": 1}, "290": {"Reviewer": "Jon Robertson", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 1, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "excellent tequila. complex and intriguing. very unique. must try for anejo fans.", "Recommend": 1}, "291": {"Reviewer": "Leticia Rininger", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 51, "Tequila": "Fortaleza Añejo", "Rating": 97, "Review": "Lot 38|Smoky", "Recommend": 1}, "292": {"Reviewer": "Mr Reese", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 16, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 35|Smooth Light fruit tequila.Comparable to El Tesoro Paradiso.", "Recommend": 1}, "293": {"Reviewer": "Oliver James II", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 44, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 34|Tremendous nose on this... rich flavors explode at first taste with caramel and toffee blending well with the agave.. great finish!!", "Recommend": 1}, "294": {"Reviewer": "Erin Meyer", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 70, "Review": "smells like a Mexican store, has a distinct herbal flavor, and smooth finish", "Recommend": 1}, "295": {"Reviewer": "Marty Neary", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 150, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Always loved the repo but I have come around on the anejo. Great Stuff", "Recommend": 1}, "296": {"Reviewer": "Bryan Cole", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 25, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 36|COLOR: Golden honeyNOSE: Sweet caramelized agave, roasted sugar, wine barrel, honey dew, melon, medium oakTASTE: Sweet roasted agave, oak, marshmallow, dark chocolate, vanilla, honey, orange peel, aniseFINISH: Heavy body, long finish, long legs, slight alcohol, whiskey barrel, sauternes wine, jammy finish, OAK!", "Recommend": 1}, "297": {"Reviewer": "Jeff Passamani", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 24, "Tequila": "Fortaleza Añejo", "Rating": 77, "Review": "Lot 33|The first thing I thought of when I tasted this was olives. Like but don't love.", "Recommend": 1}, "298": {"Reviewer": "Liz I", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Smooth and is an easy to drink!!!Enjoyed trying this at The Smoke Shop in Cambridge with MoZ.", "Recommend": 1}, "299": {"Reviewer": "Sven-Olof Ulleryd", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 65, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "It has its own, very unique powerful vanilla-herbal-minty-spicy-green-grass, earthy, floral, butterscotch,  vanilla (hard-to-nail) kind of  arom a and flavor. Sweet vanilla with a bouquet of flower.", "Recommend": 1}, "300": {"Reviewer": "Mark Petelin", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 2, "Tequila": "Fortaleza Añejo", "Rating": 83, "Review": "Lot 34|Sweet smellLight burn at first", "Recommend": 1}, "301": {"Reviewer": "Gary Laspa", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 52, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "Lot 34|OMG.  This is like candy in a glass.  Barely sweet, but simply delicious.  Hint of maple syrup and butterscotch on the nose.  The flavour is butterscotch too, with just a hint of bite, a little smoke, but little of the agave from the Reposado. ", "Recommend": 1}, "302": {"Reviewer": "Carmen Cox", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 49, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "I can't buy where I'm from so had to try while in California!  So smooth and tasty but pricey. Worth it if you are looking for a high end tequila", "Recommend": 1}, "303": {"Reviewer": "Michael  Sasse", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 1, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "Lot 25|Lot 25.", "Recommend": 1}, "304": {"Reviewer": "Damon Modula", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 29, "Tequila": "Fortaleza Añejo", "Rating": 97, "Review": "this anejo has a taste all too its own... easily the most smooth juice I've ever had.. medium oil with a strong buttery flavor... a must have for your collection.. look foward to trying fortazelas other tequilas", "Recommend": 1}, "305": {"Reviewer": "Alan Foster", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 4, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 19|Lot 19.", "Recommend": 1}, "306": {"Reviewer": "J B", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 118, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 34|Lot 34.", "Recommend": 1}, "307": {"Reviewer": "J V", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 143, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 28|Lot 28. Lot 28. Lot 28. Nice aroma light honey/vanilla with some carmel. Has a really nice sweetness to it with hints of wood and pepper. Light thin body with a nice finish and you can really start to taste the wood.", "Recommend": 1}, "308": {"Reviewer": "Luis Ramirez", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 21, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Grate tequila! First time trying it and didn't disappoint me at all! Love it!", "Recommend": 1}, "309": {"Reviewer": "Scott Rose", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Great example of an Anejo. Smooth and great flavor. Not too smokey and maybe a little sweet. If you like the other Fortaleza types, you should love this one.  Great over rocks too.", "Recommend": 1}, "310": {"Reviewer": "Nick Bouquet", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 20|Lot 20. Lot 20.", "Recommend": 1}, "311": {"Reviewer": "Daniel Montes", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 1, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 29|Lot 29. Great aroma, very rich in flavor yet a very smooth tequila. The perfect sipper.", "Recommend": 1}, "312": {"Reviewer": "Tommy Davis", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 16, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Just a tad expensive but near the top.", "Recommend": 1}, "313": {"Reviewer": "John Sellers", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 28, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "spicy peppery finish", "Recommend": 1}, "314": {"Reviewer": "EZ Slaughter. ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 86, "Review": "Lot 05|Lot 05. One of my favorites.  Just pricey.", "Recommend": 1}, "315": {"Reviewer": "David L", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 112, "Tequila": "Fortaleza Añejo", "Rating": 85, "Review": "Lot 29|Lot 29. Lot 29. Lot 29. Lot 29. Lot 29.", "Recommend": 1}, "316": {"Reviewer": "Al  Rosen", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 18, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 19|Lot 19. On par with Don Malaquias awesome", "Recommend": 1}, "317": {"Reviewer": "Alex Delgado", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 151, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 29|Lot 29.", "Recommend": 1}, "318": {"Reviewer": "Jeffrey Arnesen", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 25, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 27|Lot 27. 8/4/2015White flowers, jasmine, plumeria on the nose. Honeyed with a slight spice, not quite fully cinnamon. Citrus notes as well. On the palate: orange zest and parsley with candied peppermint ontop of smokey honey. Oak aging shows through but does not loose the agave profile. Nice balance for an anejo.Finish lingers with a little tingle, char and menthol. Light but lingering. Fantastic!", "Recommend": 1}, "319": {"Reviewer": "Kaitlyn  Alexis", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 5, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Very smooth finish. Really smooth without a whole lot of bite", "Recommend": 1}, "320": {"Reviewer": "EZ Slaughter. ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 14|Lot 14. Very very Noice.", "Recommend": 1}, "321": {"Reviewer": "Nancy Wong", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Vanilla, butterscotch, slightly sweet and smooth.", "Recommend": 1}, "322": {"Reviewer": "Agave Addict", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 42, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 13|Lot 13.", "Recommend": 1}, "323": {"Reviewer": "Scott Smith", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 36, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 25|Lot 25.", "Recommend": 1}, "324": {"Reviewer": "Cliff Dibelka", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 08|Lot 08.", "Recommend": 1}, "325": {"Reviewer": "Daniel Buss", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 146, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 25|very nice aroma that is sweet to the nose but brings a nice bite and burn when you drink it. very nice tequila .", "Recommend": 1}, "326": {"Reviewer": "Tori Standaert", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 19, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 16|Lot 16. Lot 16.  Aroma of caramel, butter cream, slight cinnamon, cooked agave. Mouthfeel warm and slightly oily. Flavors of white pepper, dried fruit, caramel and buttercream followed by Agave.  Finish is long, warm and lingers a while. Great sipping Tequila.", "Recommend": 1}, "327": {"Reviewer": "David K", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 82, "Tequila": "Fortaleza Añejo", "Rating": 81, "Review": "Light smoothe and interesting", "Recommend": 1}, "328": {"Reviewer": "Will DeRousse", "Reviewer_Level": "Tequila Connoisseur", "Ratings_Given": 69, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Complex, smooth, full flavored, fantastic.", "Recommend": 1}, "329": {"Reviewer": "Gabe Garza", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 23|Lot 23.", "Recommend": 1}, "330": {"Reviewer": "Mario Morales", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 23|Lot 23.", "Recommend": 1}, "331": {"Reviewer": "Luke Boswell", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 2, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 17|Lot 17.", "Recommend": 1}, "332": {"Reviewer": "John Hansen", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 49, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 22|Lot 22. appearance : lighter than the reposado somehow. Light straw color with moderate legsaroma : agave caramel and butterscotch notes of citrus and vanillataste : slight alcohol burn tastes of oak agave and pepper hint of caramel and butterscotch finish : lasts forever agave  pepper and oak lingerdoesn't match up to the repo but so still an incredible tequila will be keeping a bottle in the bar", "Recommend": 1}, "333": {"Reviewer": "Mike Margolies", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 171, "Tequila": "Fortaleza Añejo", "Rating": 83, "Review": "Lot 20|Lot 20.", "Recommend": 1}, "334": {"Reviewer": "Diana Hildebrand", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 36, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Lot 12|Lot 12. Amazing taste from start to finish Carmel wood smoke butterscotch", "Recommend": 1}, "335": {"Reviewer": "C Fett Mx", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 175, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 20|Lot 20.", "Recommend": 1}, "336": {"Reviewer": "Jeff Nitishin", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 19|Lot 19.", "Recommend": 1}, "337": {"Reviewer": "Jeff Nitishin", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 21|Lot 21.", "Recommend": 1}, "338": {"Reviewer": "Joshua Liberman", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 14, "Tequila": "Fortaleza Añejo", "Rating": 97, "Review": "Lot 13|Lot 13.", "Recommend": 1}, "339": {"Reviewer": "Gareth Davies", "Reviewer_Level": "Tequila Maniac", "Ratings_Given": 38, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 19|Lot 19.", "Recommend": 1}, "340": {"Reviewer": "Carrie ", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 10, "Tequila": "Fortaleza Añejo", "Rating": 74, "Review": "Super smooth. I like more bite!", "Recommend": 1}, "341": {"Reviewer": "Adam Wor", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 77, "Review": "Tasted the barrel. Pretty smooth. Prefer the Repo over the Anejo.", "Recommend": 1}, "342": {"Reviewer": "Brad Knox", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 17, "Tequila": "Fortaleza Añejo", "Rating": 99, "Review": "Lot 17|Lot 17. Lot 17.", "Recommend": 1}, "343": {"Reviewer": "St3v3 C", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 16, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Vanilla. An after dinner favorite.", "Recommend": 1}, "344": {"Reviewer": "Quixote Rocinante ", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 169, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "Still my go-to comparator to all other anejos. A classic not to be missed.", "Recommend": 1}, "345": {"Reviewer": "Kris Gorbous", "Reviewer_Level": "Tequila Freak", "Ratings_Given": 23, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Excellent tequila - smooth as silk, excellent flavour. One of my top brands, can't go wrong with any of the Fortaleza tequila - blanco is my favourite of the bunch.", "Recommend": 1}, "346": {"Reviewer": "Jonathan Apsley", "Reviewer_Level": "Tequila Fanatic", "Ratings_Given": 15, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Excellent anejo, one of the best out there. Great smoky agave flavor and ultra smooth finish.", "Recommend": 1}, "347": {"Reviewer": "JT Austin", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 43, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "One of my top 5 favorite Anejos!The lot number was 17", "Recommend": 1}, "348": {"Reviewer": "Jesse  Torres", "Reviewer_Level": "Tequila Enthusiast", "Ratings_Given": 7, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 16|Loved this anejo  until I received the reposado, I like the reposado slightly better and at the cheaper price, it wins hands down. This anejo was especially nice since it was not too woodsy in flavor, slight butterscotch and healthy in color. Slight oily which i like. I definitely buy again if the reposado didn't exist.", "Recommend": 1}, "349": {"Reviewer": "Tracie Cone", "Reviewer_Level": "Tequila Warrior", "Ratings_Given": 49, "Tequila": "Fortaleza Añejo", "Rating": 100, "Review": "Rich and complex. As good as tequila gets.", "Recommend": 1}, "350": {"Reviewer": "Frank Pasinski", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 2, "Tequila": "Fortaleza Añejo", "Rating": 78, "Review": "Best tequila for the money out there. Reposado and anejo are both excellent. Always have a bottle", "Recommend": 1}, "351": {"Reviewer": "Joe Spelman", "Reviewer_Level": "Tequila Lover", "Ratings_Given": 11, "Tequila": "Fortaleza Añejo", "Rating": 98, "Review": "Agave restaurant in NYC a must stop. see Jay", "Recommend": 1}, "352": {"Reviewer": "shekinah shephard", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 2, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "My favorite", "Recommend": 1}}