{"0": {"Reviewer": "Mike B (Great Lakes Tequila Club)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 315, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 43|The infamous Lot 43! A friend shared a glass with me and I finally got to try a holy grail tequila. What can I say about this supposedly XA-blended Añejo other than it was delicious aged Fortaleza.", "Recommend": 1}, "1": {"Reviewer": "Jon Novak", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 161, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 55|Incredible. Such a dessert sipper. Beautiful barrel notes on the nose and the palate is a treat. From beginning to finish this is a treat through and through.", "Recommend": 1}, "2": {"Reviewer": "Frankie Medina", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 287, "Tequila": "Fortaleza Añejo", "Rating": 87, "Review": "Lot 63|This lot 63 is one of the better añejo s from Fortaleza since lot 48.", "Recommend": 1}, "3": {"Reviewer": "Jon Novak", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 161, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 59|Wow! This is worth the price.  A total dessert sipper. Creamy with lots of layers.  Very amazing tequila that retains the agave on the nose and palate", "Recommend": 1}, "4": {"Reviewer": "Nick Salcedo @tequilarankings", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 93, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "On the nose, aromas of dried fig, mixed with agave, Ceylon cinnamon, and brown sugar. The flavor further melds the cinnamon and agave, with notes of dried apricot as well. The finish brings out greater depth from all the flavors, while being dangerously easy to drink.", "Recommend": 1}, "5": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 892, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 60|Nose:   A touch of cider and spice. Vanilla, fruity agave and toasty hints of oak barreling. Subdued minerals and earth. A rich, round fruity profile. Flavor:   A cohesive/harmonious first impression. Fruit, spice, mild pepper heat and mellow oak wrapped in a buttery package. It blooms as it sits on the palate.", "Recommend": 1}, "6": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 892, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 52|Nose:   Light oak sawdust aroma and warm barrel spices. Maple, coffee and vanilla. Citron and lemon blossom. Flavors:   Orange liqueur, caramel, dark chocolate and punchy pepper. Vanilla and fruit flavors develop as it breathes a bit. ", "Recommend": 1}, "7": {"Reviewer": "Andy Bardon", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 172, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 42|Lote: 42-AWhat an amazing mistake!Dried prunes, vanilla, oak, and agave. What a treat. Oily, thick, and syrupy mouthfeel. This is a very special bottle that really opens my mind to the idea of barrel blending. More research is required … twist my arm", "Recommend": 1}, "8": {"Reviewer": "Rob Gerard", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 201, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 52|Lote 52 - this is one of my favorite Añejos! Aroma - oak, cinnamon, agave, slight vanilla and caramel, with a touch of butterscotch. Flavor - oak, toasted almond, vanilla, hints of cinnamon. Finish - toffee buttery finish that has very little burn. More of a warmth in the lower chest. Easy to drink. Just fantastic to sip on!", "Recommend": 1}, "9": {"Reviewer": "Jeremy Kinney", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 153, "Tequila": "Fortaleza Añejo", "Rating": 94, "Review": "Lot 43|Super lucky to have gotten my hands on some lot 43. Amazing nose, tons of caramel, cinnamon and baking spice but still a nice pop of agave. Flavor still carries a lot more agave than I expected. Peppery, and mellowed nicely from the barrel. Very complex and an absolute gem of a tequila.", "Recommend": 1}, "10": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 892, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 51|Nose:   Initial blast of warm barrel spices. Followed up with a woodsy forest aroma, hot cider with a stick of cinnamon, vanilla, juicy fruit, oranges and grilling pineapple. Flavors:   Oily and has tons of fruit (perhaps dark cherries), dried fruit and candied fruit. It brings a spicy and peppery tingle to the tongue and esophagus. Very different from other Fortaleza añejos of recent memory. This has a dessert like quality to it. Almost tastes like some French oak was blended in. Or some XA.", "Recommend": 1}, "11": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 47|Love this as I do all releases. This seems to have more actual barrel than some Añejo releases with some slight bitterness from the re charred barrels. Nicely aromatic with agave, oak, caramel along with a nicely rounded feel in the mouth. Some slight spike in alcohol mid palate that turns to roast agave sweetness, a great tongue tingling finish that fades to that slight bitter remnant.", "Recommend": 1}, "12": {"Reviewer": "Lou  Agave (Long Island Lou Tequila)", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 399, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 42|This is the special anejo, mixed with extra anejo, and it has a great balance considering. It's got a great nose, picking up all kinds of barrel notes from the extended aging.  Absolutely delicious notes coming through, with butterscotch, smoke, vanilla, caramel, fruit, honey and butter. Delicious!!", "Recommend": 1}, "13": {"Reviewer": "Andrew Davis", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 248, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 48|Nice caramel notes on the nose. Darker color than other lotes. Heavier on the oak which is prominent and a subtle cooked agave flavor.", "Recommend": 1}, "14": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 892, "Tequila": "Fortaleza Añejo", "Rating": 89, "Review": "Lot 49|Nose:   Subtly intertwining spices of allspice, nutmeg and cardamom. Citrus, pepper, vanilla and white chocolate. Tropical fruit, slightly under ripe pineapple, and smells similar to green lumber that is drying. Flavor:   Initial pop of finely ground white pepper and baking spice. Sweet citrus, fruit, vanilla, and nutty salted caramel. Trace earthiness, cedar aromas and salinity. A touch of leather. Finish:   Bigger, bolder and more memorable finish than some recent lotes, IMHO.", "Recommend": 1}, "15": {"Reviewer": "Greg Bartolotta @aged_agave", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Lot 47|Hand crafted artesanal Anejo doesn’t get much better than this ... this is the bench mark. Good heat but tremendously balance with an incredible finish. All time favorite.", "Recommend": 1}, "16": {"Reviewer": "Ralph Jimenez", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 199, "Tequila": "Fortaleza Añejo", "Rating": 90, "Review": "Lot 42|Aroma has", "Recommend": 1}, "17": {"Reviewer": "Jose Gomez", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 142, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 42|At nose, aroma is pretty fruity. tropical fruits come to record, such as banana. Light spices too, as cinnamon. Cooked agave aroma floats beneathz as well as some butterish notes. This is not the typical añejo profile in which you get lots of dark spice, wood and vanilla. At taste it is more complex. I get the wood right away the first sip, pepper explodes in my tongue's tip. afterwards, nice cooked away come to record. Bold character in the aftertaste, featuring ripe fruit tastes while coming to an end. This is a well balances añejo that still respects agave flavour,  but marries the aging wood taste pretty well, coming to a well executed balancing act.", "Recommend": 1}, "18": {"Reviewer": "Seattle Juan", "Reviewer_Level": "Tequila Honey Badger", "Ratings_Given": 1277, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 48|Poured at MTBC 2019. Sweet agave, caramel, vanilla. Unmistakable Fortaleza creaminess and flavor.", "Recommend": 1}, "19": {"Reviewer": "Andrew Davis", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 248, "Tequila": "Fortaleza Añejo", "Rating": 93, "Review": "Lot 43|The nose on this is one of my favorites ever with vanilla being prominent.", "Recommend": 1}, "20": {"Reviewer": "Erica Boorom", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 128, "Tequila": "Fortaleza Añejo", "Rating": 92, "Review": "Aroma : Cooked agave, vanilla, caramel. Some oakiness along with butter and olives.Taste : Full bodied, oily and complex with plenty of agave for an Añejo, vanilla and caramel, more oak and butter and olives. I also got some fruity/peach notes and butterscotch.Finish : Long lasting and slightly spicy, and prolongs butter, butterscotch, and oak notes.This is a good balance of sweet and spicy, and it's very complex. I've been away the past 2 weeks, and this was a great tequila to have after so long. I'm stocked on many more tequilas so I definitely hope they measure up to this.", "Recommend": 1}, "21": {"Reviewer": "Joe Farrier", "Reviewer_Level": "Tequila Ninja", "Ratings_Given": 155, "Tequila": "Fortaleza Añejo", "Rating": 91, "Review": "Lot 40|Lot 40.  Agave flavor tempered slowly by vanilla, Carmel and butterscotch.  The finish is perfectly timed but does stop a smidge short on flavors as the entire tequila vanishes a bit too quickly.  The best anejo I’ve ever had.", "Recommend": 1}, "22": {"Reviewer": "Remy Newland", "Reviewer_Level": "Tequila Wizard", "Ratings_Given": 892, "Tequila": "Fortaleza Añejo", "Rating": 88, "Review": "Lot 46|Aroma:   This is not a typical Fortaleza añejo profile to me. The initial nose presents round, fruity cider notes, with some almost French oak character. Lively spices of green cardamom in the shell and cinnamon - and a hint of toffee. A vague vinegar aroma - but cloaked in the spice aromas. Flavors:   Spicy barrel influence, vanilla, butterscotch and white pepper. The light color of this añejo conveys a somewhat deceptive impression - it is rich and fills the mouth.", "Recommend": 1}, "23": {"Reviewer": "Senior Rick Mendell", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 283, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 42|Delicious, deeply concentrated roasted agave with an enjoyable rich, smooth finish. And a bit richer mouth feel than the Lote 43.", "Recommend": 1}, "24": {"Reviewer": "Senior Rick Mendell", "Reviewer_Level": "Tequila Savant", "Ratings_Given": 283, "Tequila": "Fortaleza Añejo", "Rating": 95, "Review": "Lot 43|Delicious, deeply concentrated roasted agave with an enjoyable peppery finish.", "Recommend": 1}}{"25": {"Reviewer": "Greg Bartolotta @aged_agave", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 361, "Tequila": "Volans Extra Añejo (6 Year)", "Rating": 89, "Review": "Amazing nose, light in color yet rich in flavors of spice, cooked agave and light barrel notes. This tequila took over 13 yrs to get to market. It is costly but special.", "Recommend": 1}, "26": {"Reviewer": "Doug Price", "Reviewer_Level": "Tequila Phenom", "Ratings_Given": 312, "Tequila": "Volans Extra Añejo (6 Year)", "Rating": 93, "Review": "What a treat to taste this brand new 6 year XA from Volans. It’s pricey but they started this project over 6 years ago when the brand first formed. If your budget allows for it, this should be in your collection. It takes the original XA to new layers of depth with a little higher ABV. Congrats Volans. Another masterpiece from El Pandillo and Volans.", "Recommend": 1}, "27": {"Reviewer": "Gregory Agave Spectator", "Reviewer_Level": "Tequila Aficionado", "Ratings_Given": 50, "Tequila": "Volans Extra Añejo (6 Year)", "Rating": 96, "Review": "This epic XA with a light caramel color holds a complex body and lavish layers of floral, dried fruit, citrus, baking spices, chocolate and salty caramel flavors balanced with mineral and cask notes.  Our first sip awoke our palate with juicy citrus flavors, the second sip revealed layers of complex notes, and our third sip left us with a long lasting elegant finish steeped in El Pandillo terroir.  Felipe is the ultimate maestro, and this 6yr XA is one of his greatest works of art.  Very highly recommended.", "Recommend": 1}, "28": {"Reviewer": "John Spinale", "Reviewer_Level": "Tequila Guru", "Ratings_Given": 88, "Tequila": "Volans Extra Añejo (6 Year)", "Rating": 95, "Review": "absolutely unreal. easy to drink, even at higher proof. amazing spice character with cooked agave still shining through. this is now my gold standard.", "Recommend": 1}, "29": {"Reviewer": "Dean Powers", "Reviewer_Level": "Tequila Fan", "Ratings_Given": 3, "Tequila": "Volans Extra Añejo (6 Year)", "Rating": 96, "Review": "Cooked agave w/ oak- subtle sweetness-jasmine- butterscotch/caramel- mild smoke- green peppercorn- mild ripe grapes", "Recommend": 1}}